app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."netid" = 'herrm' LIMIT 1
INSERT INTO "users" ("created_at", "netid", "privilege", "remember_token", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
  	initialize
  	routey_id=params[:session][:netid]
  	routey_password = params[:session][:password]
    ldap.host = "ldap.byu.edu"
    ldap.auth "uid=#{routey_id},ou=People,o=BYU.edu", routey_password
    Rails.logger.warn ldap.bind
    if !routey_password.empty? and ldap.bind # true | false | throw timeout
    	Rails.logger.warn "INSIDE!"
    	user = Users.find_by(netid: routey_id)
    	if !user
    		user = Users.create(netid: routey_id, privilege: "student")